---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointElementHostedParam
source: html/6216b937-5be9-97b4-7161-3fd7dc2fc583.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointElementHostedParam Property

"Hosted Parameter"

## Syntax (C#)
```csharp
public static ForgeTypeId PointElementHostedParam { get; }
```